; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-12)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city7)
	(fuel-level plane1 fl0)
	(at plane2 city5)
	(fuel-level plane2 fl6)
	(at plane3 city2)
	(fuel-level plane3 fl1)
	(at plane4 city19)
	(fuel-level plane4 fl5)
	(at plane5 city6)
	(fuel-level plane5 fl2)
	(at person1 city0)
	(at person2 city15)
	(at person3 city16)
	(at person4 city12)
	(at person5 city15)
	(at person6 city16)
	(at person7 city1)
	(at person8 city0)
	(at person9 city6)
	(at person10 city10)
	(at person11 city2)
	(at person12 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city12)
	(at plane4 city4)
	(at person1 city19)
	(at person3 city16)
	(at person4 city21)
	(at person5 city14)
	(at person6 city21)
	(at person7 city17)
	(at person8 city2)
	(at person9 city13)
	(at person10 city21)
	(at person12 city14)
	))

)

; plan
1. (fly plane5 city6 city0 fl2 fl1)
   deleted: (at plane5 city6) (fuel-level plane5 fl2)
   added: (at plane5 city0) (fuel-level plane5 fl1)
   goals met: 1 of 12
2. (board person8 plane5 city0)
   deleted: (at person8 city0)
   added: (in person8 plane5)
   goals met: 1 of 12
3. (board person1 plane5 city0)
   deleted: (at person1 city0)
   added: (in person1 plane5)
   goals met: 1 of 12
4. (zoom plane4 city19 city1 fl5 fl4 fl3)
   deleted: (at plane4 city19) (fuel-level plane4 fl5)
   added: (at plane4 city1) (fuel-level plane4 fl3)
   goals met: 1 of 12
5. (board person7 plane4 city1)
   deleted: (at person7 city1)
   added: (in person7 plane4)
   goals met: 1 of 12
6. (zoom plane4 city1 city10 fl3 fl2 fl1)
   deleted: (at plane4 city1) (fuel-level plane4 fl3)
   added: (at plane4 city10) (fuel-level plane4 fl1)
   goals met: 1 of 12
7. (board person10 plane4 city10)
   deleted: (at person10 city10)
   added: (in person10 plane4)
   goals met: 1 of 12
8. (zoom plane2 city5 city12 fl6 fl5 fl4)
   deleted: (at plane2 city5) (fuel-level plane2 fl6)
   added: (at plane2 city12) (fuel-level plane2 fl4)
   goals met: 2 of 12
9. (board person4 plane2 city12)
   deleted: (at person4 city12)
   added: (in person4 plane2)
   goals met: 2 of 12
10. (fly plane5 city0 city19 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city19) (fuel-level plane5 fl0)
   goals met: 2 of 12
11. (refuel plane5 city19 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 2 of 12
12. (debark person1 plane5 city19)
   deleted: (in person1 plane5)
   added: (at person1 city19)
   goals met: 3 of 12
13. (fly plane5 city19 city2 fl1 fl0)
   deleted: (at plane5 city19) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 3 of 12
14. (debark person8 plane5 city2)
   deleted: (in person8 plane5)
   added: (at person8 city2)
   goals met: 4 of 12
15. (zoom plane2 city12 city21 fl4 fl3 fl2)
   deleted: (at plane2 city12) (fuel-level plane2 fl4)
   added: (at plane2 city21) (fuel-level plane2 fl2)
   goals met: 3 of 12
16. (debark person4 plane2 city21)
   deleted: (in person4 plane2)
   added: (at person4 city21)
   goals met: 4 of 12
17. (zoom plane2 city21 city12 fl2 fl1 fl0)
   deleted: (at plane2 city21) (fuel-level plane2 fl2)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 5 of 12
18. (fly plane4 city10 city17 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city17) (fuel-level plane4 fl0)
   goals met: 5 of 12
19. (refuel plane4 city17 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 12
20. (debark person7 plane4 city17)
   deleted: (in person7 plane4)
   added: (at person7 city17)
   goals met: 6 of 12
21. (fly plane4 city17 city21 fl1 fl0)
   deleted: (at plane4 city17) (fuel-level plane4 fl1)
   added: (at plane4 city21) (fuel-level plane4 fl0)
   goals met: 6 of 12
22. (refuel plane4 city21 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 12
23. (debark person10 plane4 city21)
   deleted: (in person10 plane4)
   added: (at person10 city21)
   goals met: 7 of 12
24. (fly plane4 city21 city13 fl1 fl0)
   deleted: (at plane4 city21) (fuel-level plane4 fl1)
   added: (at plane4 city13) (fuel-level plane4 fl0)
   goals met: 7 of 12
25. (refuel plane4 city13 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 12
26. (board person12 plane4 city13)
   deleted: (at person12 city13)
   added: (in person12 plane4)
   goals met: 7 of 12
27. (fly plane4 city13 city14 fl1 fl0)
   deleted: (at plane4 city13) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 7 of 12
28. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 12
29. (debark person12 plane4 city14)
   deleted: (in person12 plane4)
   added: (at person12 city14)
   goals met: 8 of 12
30. (fly plane4 city14 city15 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city15) (fuel-level plane4 fl0)
   goals met: 8 of 12
31. (refuel plane4 city15 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 12
32. (board person5 plane4 city15)
   deleted: (at person5 city15)
   added: (in person5 plane4)
   goals met: 8 of 12
33. (fly plane4 city15 city14 fl1 fl0)
   deleted: (at plane4 city15) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 8 of 12
34. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 12
35. (debark person5 plane4 city14)
   deleted: (in person5 plane4)
   added: (at person5 city14)
   goals met: 9 of 12
36. (fly plane4 city14 city16 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city16) (fuel-level plane4 fl0)
   goals met: 9 of 12
37. (refuel plane4 city16 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 12
38. (board person6 plane4 city16)
   deleted: (at person6 city16)
   added: (in person6 plane4)
   goals met: 9 of 12
39. (fly plane4 city16 city21 fl1 fl0)
   deleted: (at plane4 city16) (fuel-level plane4 fl1)
   added: (at plane4 city21) (fuel-level plane4 fl0)
   goals met: 9 of 12
40. (refuel plane4 city21 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 12
41. (debark person6 plane4 city21)
   deleted: (in person6 plane4)
   added: (at person6 city21)
   goals met: 10 of 12
42. (fly plane4 city21 city4 fl1 fl0)
   deleted: (at plane4 city21) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 11 of 12
43. (fly plane3 city2 city6 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 11 of 12
44. (board person9 plane3 city6)
   deleted: (at person9 city6)
   added: (in person9 plane3)
   goals met: 11 of 12
45. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 12
46. (fly plane3 city6 city13 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 11 of 12
47. (debark person9 plane3 city13)
   deleted: (in person9 plane3)
   added: (at person9 city13)
   goals met: 12 of 12
